renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_qspi_smstr_rx/src/r_qspi_smstr.c
    return QSPI_SMSTR_SUCCESS;
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Close
 *****************************************************************************************************************/ /**
 * @brief This function is used to release the resources of the QSPI FIT module currently in use.
 * @param[in] channel
 *             QSPI channel number
 * @retval    QSPI_SMSTR_SUCCESS    Successful operation
 * @retval    QSPI_SMSTR_ERR_PARAM  Parameter error
 * @details   Sets the QSPI of the channel number specified by the argument channel to the module stop state. \n
 *            When the function completes successfully, the QSPCLK pin is set as general output port in the high-output
 *            state, and the QIO0 to QIO3 pins are set as a general input port.\n
 *            Note that this function releases the QSPI resource for the channel number specified by the argument
 *            channel. To restart communication, call R_QSPI_SMstr_Open().\n
 *            Do not call this function when communication is in progress. Communication cannot be guaranteed if the
 *            function is called when communication is in progress.
 * @note      This function controls the GPIO and MPC to set each pin as a general I/O port. Confirm that no other
 *            peripheral function is using any of the affected pins before calling this function.\n
 *            After this function is called the states of the QSPCLK pin differ from that after a reset (general input 
 *            port). Review the pin settings if necessary.
 */
qspi_smstr_status_t R_QSPI_SMstr_Close(uint8_t channel)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    /* Set module stop of QSPI. */
    r_qspi_smstr_disable(channel);
    
    /* Reset setting of ports. */
    r_qspi_smstr_io_reset(channel);
    
    /* QSPI hardware unlock */
#ifdef QSPI_SMSTR_CFG_USE_FIT
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_QSPI + channel));
#endif  /* QSPI_SMSTR_CFG_USE_FIT */
    
    return QSPI_SMSTR_SUCCESS;
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Control
 *****************************************************************************************************************/ /**
 * @brief This function is used to change settings such as the bit rate and QSPCLK phase/polarity.
 * @param[in] channel
 *             QSPI channel number
 * @param[in] clk_mode
 *             QSPCLK mode. Make the following settings.\n
 *              clk_mode = 0: CPOL = 0, CPHA = 0\n
 *              clk_mode = 1: CPOL = 0, CPHA = 1\n
 *              clk_mode = 2: CPOL = 1, CPHA = 0\n
 *              clk_mode = 3: CPOL = 1, CPHA = 1
 * @param[in] spbr_data
 *             QSPI bit rate register (SPBR) setting value
 * @retval    QSPI_SMSTR_SUCCESS    Successful operation
 * @retval    QSPI_SMSTR_ERR_PARAM  Parameter error
 * @details   Changes settings such as the QSPI bit rate and QSPCLK phase/polarity for the channel number specified by
 *            the argument channel. \n
 *            Sets the value specified by the argument spbr_data in the QSPI bit rate register. In the QSPI FIT module 
 *            the setting value of the bit rate division setting bits (SPCMD0.BRDV[1:0]) is 0. Refer to the User's 
 *            Manual: Hardware of the microcontroller and set spbr_data as appropriate for the operating environment.\n
 *            Do not call this function when communication is in progress. Communication cannot be guaranteed if this
 *            function is called when communication is in progress.
 * @note      None
 */
qspi_smstr_status_t R_QSPI_SMstr_Control(uint8_t channel, uint8_t clk_mode, uint8_t spbr_data)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    if (3 < clk_mode)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    /* Change SPI clock mode and bit rate of QSPI. */
    r_qspi_smstr_change(channel, clk_mode, spbr_data);
    
    return QSPI_SMSTR_SUCCESS;
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Write
 *****************************************************************************************************************/ /**
 * @brief This function is used to transmit data.
 * @param[in] channel
 *             QSPI channel number
 * @param[in] *p_qspi_smstr_info
 *             QSPI information structure\n
 * @retval    QSPI_SMSTR_SUCCESS    Successful operation
 * @retval    QSPI_SMSTR_ERR_PARAM  Parameter error
 * @retval    QSPI_SMSTR_ERR_HARD   Hardware error
 * @details   Uses the QSPI of the channel number specified by the argument channel to transmit data. \n
 *            When DMAC transfer or DTC transfer is specified by the argument tran_mode, the transferrable byte counts 
 *            are multiples of 16. If the value is not a multiple of 16, the function ends with an error and no 
 *            transfer takes place. \n
 * @note      Take note of the following points when specifying DMAC transfer or DTC transfer. \n
 *            \li The DMAC FIT module, DTC FIT module, and timer module (CMT FIT module, for example) must be obtained 
 *              separately. \n
 *            \li Use a buffer address aligned with a 4-byte boundary. \n
 *            \li Specify a transfer data count that is a multiple of 16 when calling this function. If the transfer
 *              data count results in a final transfer with a data count of 1 to 15, specify software transfer instead 
 *              when calling this function. \n
 *            \li Make settings such that block transfer is selected as the transfer mode and 16 bytes of data are
 *              transferred for each activation source. For example, is the data transfer size is 4 bytes, specify a 
 *              block transfer count of 4. \n
 *            \li The data transmit-end wait processing function r_qspi_smstr_tx_dmacdtc_wait() uses a timer. Before 
 *              calling this function, activate a 1 millisecond (ms) timer using the CMT, or the like. Then call 
 *              R_QSPI_SMstr_1ms_Interval() at 1 millisecond (ms) intervals. \n
 *            \li Make the necessary settings to make the DMAC or DTC ready to start before calling this function. \n
 *            \li If this function is called by setting tran_mode to QSPI_SMSTR_DMAC before the DMAC is ready to be
 *              activated, no DMAC transfer will take place. The return value in this case is QSPI_SMSTR_ERR_HARD. \n
 *            \li If this function is called by setting tran_mode to QSPI_SMSTR_DTC before the DTC is ready to be
 *              activated, no DTC transfer will take place. The return value in this case is QSPI_SMSTR_ERR_HARD. \n
 *            \li When calling this function in the setting of DMAC transfer or DTC transfer and Little endian, change 
 *              the data sequence of transmitted data stored in the buffer, and then send the data. After the 
 *              transmission is complete, original data will be returned.
 */
qspi_smstr_status_t R_QSPI_SMstr_Write(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info->data_cnt)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

