renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_qspi_smstr_rx/src/r_qspi_smstr.c
    if (0 == p_qspi_smstr_info->p_tx_data)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if ((QSPI_SMSTR_SINGLE_SPI_READ      == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if ((QSPI_SMSTR_DMAC == p_qspi_smstr_info->tran_mode) ||
        (QSPI_SMSTR_DTC  == p_qspi_smstr_info->tran_mode))
    {
        /* ---- Check the buffer boundary (4-byte unit). ---- */
        /* Cast the variable to a uint32_t type because the address of this pointer may not be 4-byte unit. */
        if (0 != ((uint32_t)p_qspi_smstr_info->p_tx_data & 0x00000003u))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return QSPI_SMSTR_ERR_PARAM;
        }

        /* ---- Check the counter (16-byte unit). ---- */
        /* NOTE: Do not support the number of data other than a multiple of 16 using DMAC or DTC. */
        if (0 != (p_qspi_smstr_info->data_cnt & 0x0000000fu))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return QSPI_SMSTR_ERR_PARAM;
        }
    }

    switch (p_qspi_smstr_info->tran_mode)
    {
        case QSPI_SMSTR_SW:
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_WRITE:
                    ret = r_qspi_smstr_single_writeread_software(channel, p_qspi_smstr_info);
                break;
                case QSPI_SMSTR_DUAL_SPI:
                case QSPI_SMSTR_QUAD_SPI:
                    ret = r_qspi_smstr_dualquad_write_software(channel, p_qspi_smstr_info);
                break;
                default:
                    ret = QSPI_SMSTR_ERR_PARAM;
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                break;
            }
        break;
        case QSPI_SMSTR_DMAC:
        case QSPI_SMSTR_DTC:
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_WRITE:
                    ret = r_qspi_smstr_single_writeread_dmacdtc(channel, p_qspi_smstr_info);
                break;
                case QSPI_SMSTR_DUAL_SPI:
                case QSPI_SMSTR_QUAD_SPI:
                    ret = r_qspi_smstr_dualquad_write_dmacdtc(channel, p_qspi_smstr_info);
                break;
                default:
                    ret = QSPI_SMSTR_ERR_PARAM;
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                break;
            }
        break;
        default:
            ret = QSPI_SMSTR_ERR_PARAM;
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        break;
    }

    return ret;
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Read
 *****************************************************************************************************************/ /**
 * @brief This function is used to receive data.
 * @param[in] channel
 *             QSPI channel number
 * @param[in] *p_qspi_smstr_info
 *             QSPI information structure
 * @retval    QSPI_SMSTR_SUCCESS     Successful operation
 * @retval    QSPI_SMSTR_ERR_PARAM   Parameter error
 * @retval    QSPI_SMSTR_ERR_HARD    Hardware error
 * @details   Uses the QSPI of the channel number specified by the argument channel to receive data. \n
 *            When DMAC transfer or DTC transfer is specified by the argument tran_mode, the transferrable byte counts 
 *            are multiples of 16. If the value is not a multiple of 16, the function ends with an error and no 
 *            transfer takes place. \n
 * @note      Add the following processing when specifying DMAC transfer or DTC transfer. \n
 *            \li The DMAC FIT module, DTC FIT module, and timer module (CMT FIT module, for example) must be obtained 
 *              separately. \n
 *            \li Use a buffer address aligned with a 4-byte boundary. \n
 *            \li Specify a transfer data count that is a multiple of 16 when calling this function. If the transfer 
 *              data count results in a final transfer with a data count of 1 to 15, specify software transfer instead 
 *              when calling this function. \n
 *            \li Make settings such that block transfer is selected as the transfer mode and 16 bytes of data are
 *              transferred for each activation source. For example, is the data transfer size is 4 bytes, specify a 
 *              block transfer count of 4. \n
 *            \li The data transmit-end wait processing function r_qspi_smstr_tx_dmacdtc_wait() uses a timer. Before 
 *              calling this function, activate a 1 millisecond (ms) timer using the CMT, or the like. Then call 
 *              R_QSPI_SMstr_1ms_Interval() at 1 millisecond (ms) intervals. \n
 *            \li Make the necessary settings to make the DMAC or DTC ready to start before calling this function. \n
 *            \li If this function is called by setting tran_mode to QSPI_SMSTR_DMAC before the DMAC is ready to be 
 *              activated, no DMAC transfer will take place. The return value in this case is QSPI_SMSTR_ERR_HARD. \n
 *            \li If this function is called by setting tran_mode to QSPI_SMSTR_DTC before the DTC is ready to be 
 *              activated, no DTC transfer will take place. The return value in this case is QSPI_SMSTR_ERR_HARD.
 */
qspi_smstr_status_t R_QSPI_SMstr_Read(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info->data_cnt)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info->p_rx_data)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if ((QSPI_SMSTR_SINGLE_SPI_WRITE     == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if ((QSPI_SMSTR_DMAC == p_qspi_smstr_info->tran_mode) ||
        (QSPI_SMSTR_DTC  == p_qspi_smstr_info->tran_mode))
    {
        /* ---- Check the buffer boundary (4-byte unit). ---- */
        /* Cast the variable to a uint32_t type because the address of this pointer may not be 4 bytes unit. */
        if (0 != ((uint32_t)p_qspi_smstr_info->p_rx_data & 0x00000003u))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return QSPI_SMSTR_ERR_PARAM;
        }

        /* ---- Check the counter (16-byte unit). ---- */
        /* NOTE: Do not support the number of data other than a multiple of 16 using DMAC or DTC. */
        if (0 != (p_qspi_smstr_info->data_cnt & 0x0000000fu))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return QSPI_SMSTR_ERR_PARAM;
        }
    }

    switch (p_qspi_smstr_info->tran_mode)
    {
        case QSPI_SMSTR_SW:
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_READ:
                    ret = r_qspi_smstr_single_writeread_software(channel, p_qspi_smstr_info);
                break;
                case QSPI_SMSTR_DUAL_SPI:
                case QSPI_SMSTR_QUAD_SPI:
                    ret = r_qspi_smstr_dualquad_read_software(channel, p_qspi_smstr_info);
                break;
                default:
                    ret = QSPI_SMSTR_ERR_PARAM;
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                break;
            }
        break;
        case QSPI_SMSTR_DMAC:
        case QSPI_SMSTR_DTC:
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_READ:
                    ret = r_qspi_smstr_single_writeread_dmacdtc(channel, p_qspi_smstr_info);
                break;
                case QSPI_SMSTR_DUAL_SPI:
                case QSPI_SMSTR_QUAD_SPI:
                    ret = r_qspi_smstr_dualquad_read_dmacdtc(channel, p_qspi_smstr_info);
                break;
                default:
                    ret = QSPI_SMSTR_ERR_PARAM;
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                break;
            }
        break;
        default:
            ret = QSPI_SMSTR_ERR_PARAM;
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        break;
    }

    return ret;
}


