renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_qspi_smstr_rx/src/r_qspi_smstr.c
                        /* ---- Update address of receive data. ---- */
                        p_rx_data   += (uint8_t)QSPI_FIFO_HALF_SIZE;
                    break;
                    case QSPI_SMSTR_SINGLE_SPI_WRITE:
                        r_qspi_smstr_rx_software_trans_dummy(channel);
                    break;
                    default:
                        /* Do nothing. */
                    break;
                }

                /* Clear flag of receive buffer full. */
                r_qspi_smstr_sprff_clear(channel);
            }
            while (QSPI_FIFO_HALF_SIZE <= trx_cnt); /* WAIT_LOOP */
        }
        
        /* ---- Check receive buffer full. ---- */
        trx_wait = QSPI_SMSTR_RX_WAIT;
        ret     = r_qspi_smstr_wait(spsr_addr, trx_wait, QSPI_SMSTR_MASK_SPRFF);
        if (QSPI_SMSTR_ERR_HARD == ret)
        {
            /* ---- Disable QSPI transmission and reception. ---- */
            r_qspi_smstr_trx_disable(channel);
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return ret;
        }

        /* ---- Transfer dummy data from QSPI Data Register to RAM. ---- */
        switch (p_qspi_smstr_info->op_mode)
        {
            case QSPI_SMSTR_SINGLE_SPI_READ:
            case QSPI_SMSTR_SINGLE_SPI_WRITEREAD:
                /* ---- Read receive data in long. ---- */
                r_qspi_smstr_rx_software_trans(channel, &rx_data[0]);

                /* Exchange data by endian. */
                r_qspi_smstr_rx_exchg(channel, p_rx_data, &rx_data[0]);

                /* ---- Update address of receive data. ---- */
                p_rx_data   += (uint8_t)QSPI_FIFO_HALF_SIZE;
            break;
            case QSPI_SMSTR_SINGLE_SPI_WRITE:
                r_qspi_smstr_rx_software_trans_dummy(channel);
            break;
            default:
                /* Do nothing. */
            break;
        }

        /* Clear flag of receive buffer full. */
        r_qspi_smstr_sprff_clear(channel);
    }
    
    if (0 != trx_cnt)
    {
        /* ---- Check transmit buffer empty. ---- */
        trx_wait = QSPI_SMSTR_TX_WAIT;
        ret     = r_qspi_smstr_wait(spsr_addr, trx_wait, QSPI_SMSTR_MASK_SPTEF);
        if (QSPI_SMSTR_ERR_HARD == ret)
        {
            /* ---- Disable QSPI transmission and reception. ---- */
            r_qspi_smstr_trx_disable(channel);
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return ret;
        }

        /* Set data to transmit buffer. */
        cnt = trx_cnt;
        do
        {
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_WRITE:
                case QSPI_SMSTR_SINGLE_SPI_WRITEREAD:
                    /* Write transmit data in byte. */
                    r_qspi_smstr_data_set_byte(channel, *p_tx_data);

                    /* Update address of transmit data. */
                    p_tx_data++;
                break;
                case QSPI_SMSTR_SINGLE_SPI_READ:
                    /* Write dummy data in order to receive data in byte. */
                    r_qspi_smstr_data_set_byte(channel, QSPI_SMSTR_DUMMY_DATA_BYTE);
                break;
                default:
                    /* Do nothing. */
                break;
            }
            cnt--;
        }
        while (0 != cnt); /* WAIT_LOOP */
    }

    /* ---- Check QSSL negation. ---- */
    trx_wait = QSPI_SMSTR_QSSL_WAIT;
    ret     = r_qspi_smstr_wait(spsr_addr, trx_wait, QSPI_SMSTR_MASK_SPSSLF);
    if (QSPI_SMSTR_ERR_HARD == ret)
    {
        /* ---- Disable QSPI transmission and reception. ---- */
        r_qspi_smstr_trx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    if (0 != trx_cnt)
    {
        /* Store data to receive buffer. */
        do
        {
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_READ:
                case QSPI_SMSTR_SINGLE_SPI_WRITEREAD:
                    /* Read receive data in byte. */
                    *p_rx_data = r_qspi_smstr_data_get_byte(channel);

                    /* Update address of transmit data. */
                    p_rx_data++;
                break;
                case QSPI_SMSTR_SINGLE_SPI_WRITE:
                    /* Dummy read in byte */
                    uc_tmp = r_qspi_smstr_data_get_byte(channel);
                break;
                default:
                    /* Do nothing. */
                break;
            }
            /* Update count of receive data. */
            trx_cnt--;
        }
        while (0 != trx_cnt); /* WAIT_LOOP */
    }
    
    /* Clear flags of transmit buffer empty, receive buffer full and QSSL negation. */
    /* Disable QSPI transmission and reception. */
    r_qspi_smstr_trx_disable(channel);
    
    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dualquad_write_software
* Description  : Transmits data, receives data and stores to the specified buffer in dual or quad mode using software.
* Arguments    : channel -
*                    Which channel to use
*                * p_qspi_smstr_info -
*                    QSPI information
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_dualquad_write_software(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    uint32_t            tx_wait;
    uint32_t            tx_cnt;
    uint32_t            tx_data[4];
    uint8_t           * p_tx_data;
    volatile uint8_t R_BSP_EVENACCESS_SFR * spsr_addr;
    
    /* Get address of status register for QSPI. */
    spsr_addr = r_qspi_smstr_spsr_addr(channel);
    
    /* ---- Get QSPI information. ---- */
    tx_cnt      = p_qspi_smstr_info->data_cnt;
    p_tx_data   = p_qspi_smstr_info->p_tx_data;
    
