renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_qspi_smstr_rx/src/r_qspi_smstr.c
    /* Clear flags of transmit buffer empty and QSSL negation. */
    /* Enable QSPI transmission. */
    if (QSPI_SMSTR_DUAL_SPI == p_qspi_smstr_info->op_mode)
    {
        /* Enable QSPI transmission in Dual-SPI. */
        r_qspi_smstr_tx_enable_dual(channel, tx_cnt);
    }
    else
    {
        /* Enable QSPI transmission in Quad-SPI. */
        r_qspi_smstr_tx_enable_quad(channel, tx_cnt);
    }
    
    /* ==== Start QSPI transmission. ==== */
    /* Transmit of the data more than half of the transmit buffer size. */
    if (QSPI_FIFO_HALF_SIZE <= tx_cnt)
    {
        do
        {
            /* Exchange data by endian. */
            r_qspi_smstr_tx_exchg(channel, p_tx_data, &tx_data[0]);

            /* ---- Check transmit buffer empty. ---- */
            /* NOTE: Do not execute wait processing anymore when the flag is set.
                     Because the wait processing takes long time. */
            if (0 == (QSPI_SMSTR_MASK_SPTEF & (*spsr_addr)))
            {
                tx_wait = QSPI_SMSTR_TX_WAIT;
                ret     = r_qspi_smstr_wait(spsr_addr, tx_wait, QSPI_SMSTR_MASK_SPTEF);
                if (QSPI_SMSTR_ERR_HARD == ret)
                {
                    /* ---- Disable QSPI transmission. ---- */
                    r_qspi_smstr_tx_disable(channel);
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                    return ret;
                }
            }

            /* ---- Transfer data from RAM to QSPI Data Register. ---- */
            r_qspi_smstr_tx_software_trans(channel, &tx_data[0]);

            /* ---- Update count and address of transmit data. ---- */
            tx_cnt      -= QSPI_FIFO_HALF_SIZE;
            p_tx_data   += (uint8_t)QSPI_FIFO_HALF_SIZE;

            /* Clear flag of transmit buffer empty. */
            r_qspi_smstr_sptef_clear(channel);
        }
        while (QSPI_FIFO_HALF_SIZE <= tx_cnt); /* WAIT_LOOP */
    }

    /* Transmit the data which are smaller than half of the transmit buffer size. */
    if (0 != tx_cnt)
    {
        /* ---- Check transmit buffer empty. ---- */
        tx_wait = QSPI_SMSTR_TX_WAIT;
        ret     = r_qspi_smstr_wait(spsr_addr, tx_wait, QSPI_SMSTR_MASK_SPTEF);
        if (QSPI_SMSTR_ERR_HARD == ret)
        {
            /* ---- Disable QSPI transmission. ---- */
            r_qspi_smstr_tx_disable(channel);
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return ret;
        }

        do
        {
            /* Write transmit data in byte. */
            r_qspi_smstr_data_set_byte(channel, *p_tx_data);

            /* Update count and address of transmit data. */
            p_tx_data++;
            tx_cnt--;
        }
        while (0 != tx_cnt); /* WAIT_LOOP */
    }
    
    /* ---- Check QSSL negation. ---- */
    tx_wait = QSPI_SMSTR_QSSL_WAIT;
    ret     = r_qspi_smstr_wait(spsr_addr, tx_wait, QSPI_SMSTR_MASK_SPSSLF);
    if (QSPI_SMSTR_ERR_HARD == ret)
    {
        /* ---- Disable QSPI transmission. ---- */
        r_qspi_smstr_tx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }
    
    /* Clear flags of transmit buffer empty and QSSL negation. */
    /* Disable QSPI transmission. */
    r_qspi_smstr_tx_disable(channel);
    
    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dualquad_read_software
* Description  : Receives data and stores to the specified buffer in dual or quad mode using software.
* Arguments    : channel -
*                    Which channel to use
*                * p_qspi_smstr_info -
*                    QSPI information
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_dualquad_read_software(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    uint32_t            rx_wait;
    uint32_t            rx_cnt;
    uint32_t            rx_data[4];
    uint8_t           * p_rx_data;
    volatile uint8_t R_BSP_EVENACCESS_SFR * spsr_addr;

    /* Get address of status register for QSPI. */
    spsr_addr = r_qspi_smstr_spsr_addr(channel);
    
    /* ---- Get QSPI information. ---- */
    rx_cnt      = p_qspi_smstr_info->data_cnt;
    p_rx_data   = p_qspi_smstr_info->p_rx_data;

    /* Clear flags of receive buffer full and QSSL negation. */
    /* Enable QSPI reception. */
    if (QSPI_SMSTR_DUAL_SPI == p_qspi_smstr_info->op_mode)
    {
        /* Enable QSPI reception in Dual-SPI. */
        r_qspi_smstr_rx_enable_dual(channel, rx_cnt);
    }
    else
    {
        /* Enable QSPI reception in Quad-SPI. */
        r_qspi_smstr_rx_enable_quad(channel, rx_cnt);
    }
    
    /* ==== Start QSPI reception. ==== */
    /* Receive of the data more than half of the receive buffer size. */
    if (QSPI_FIFO_HALF_SIZE <= rx_cnt)
    {
        do
        {
            /* ---- Check receive buffer full. ---- */
            /* NOTE: Do not execute wait processing anymore when the flag is set.
                     Because the wait processing takes long time. */
            if (0 == (QSPI_SMSTR_MASK_SPRFF & (*spsr_addr)))
            {
                rx_wait = QSPI_SMSTR_RX_WAIT;
                ret     = r_qspi_smstr_wait(spsr_addr, rx_wait, QSPI_SMSTR_MASK_SPRFF);
                if (QSPI_SMSTR_ERR_HARD == ret)
                {
                    /* ---- Disable QSPI reception. ---- */
                    r_qspi_smstr_rx_disable(channel);
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                    return ret;
                }
            }

            /* ---- Transfer data from QSPI Data Register to RAM. ---- */
            r_qspi_smstr_rx_software_trans(channel, &rx_data[0]);

            /* Exchange data by endian. */
            r_qspi_smstr_rx_exchg(channel, p_rx_data, &rx_data[0]);

            /* ---- Update count and address of receive data. ---- */
            rx_cnt      -= QSPI_FIFO_HALF_SIZE;
            p_rx_data   += (uint8_t)QSPI_FIFO_HALF_SIZE;

            /* ---- Clear flag of receive buffer full. ---- */
            r_qspi_smstr_sprff_clear(channel);
        }
        while (QSPI_FIFO_HALF_SIZE <= rx_cnt); /* WAIT_LOOP */
    }

    /* ---- Check QSSL negation. ---- */
    rx_wait = QSPI_SMSTR_QSSL_WAIT;
    ret     = r_qspi_smstr_wait(spsr_addr, rx_wait, QSPI_SMSTR_MASK_SPSSLF);
    if (QSPI_SMSTR_ERR_HARD == ret)
    {
        /* ---- Disable QSPI reception. ---- */
        r_qspi_smstr_rx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }
    
    /* Receive the data which are smaller than half of the receive buffer size. */
    if (0 != rx_cnt)
    {
        do
        {
            /* Read receive data in byte. */
            *p_rx_data = r_qspi_smstr_data_get_byte(channel);

            /* Update count and address of receive data. */
            p_rx_data++;
            rx_cnt--;
        }
        while (0 != rx_cnt); /* WAIT_LOOP */
    }
    
    /* Clear flags of receive buffer full and QSSL negation. */
    /* Disable QSPI reception. */
    r_qspi_smstr_rx_disable(channel);
    
