renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_qspi_smstr_rx/src/r_qspi_smstr.c
    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_single_writeread_dmacdtc
* Description  : Transmits data, receives data and stores to the specified buffer in dual or quad mode using DMAC or DTC.
* Arguments    : channel -
*                    Which channel to use
*                * p_qspi_smstr_info -
*                    QSPI information
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_single_writeread_dmacdtc(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    uint32_t            tx_wait;
    volatile uint8_t R_BSP_EVENACCESS_SFR * spsr_addr;
    uint8_t * p_tx_data = NULL;
    uint8_t * p_rx_data = NULL;

    /* Get address of status register for QSPI. */
    spsr_addr   = r_qspi_smstr_spsr_addr(channel);

    /* ---- Beforehand exchange transmit data according to endian. ----*/
    if ((QSPI_SMSTR_SINGLE_SPI_WRITE     == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        p_tx_data = p_qspi_smstr_info->p_tx_data;
        ret = r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
        if (QSPI_SMSTR_SUCCESS != ret)
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return ret;
        }
    }

    /* Set DMAC/DTC transfer end flag for SPTI and SPTI. */
    R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_START);
    R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_START);

    /* Initialize SPTI and SPRI interrupt registers. */
    r_qspi_smstr_int_spti_init(channel);
    r_qspi_smstr_int_spri_init(channel);

    /* Clear flags of transmit buffer empty, receive buffer full and QSSL negation. */
    /* Enable QSPI transmission and reception in Single-SPI. */
    r_qspi_smstr_trx_enable_single(channel, p_qspi_smstr_info->data_cnt);

    /* Set the ICU.IERm.IENj bit to 1. */
    r_qspi_smstr_int_spri_ier_set(channel);
    r_qspi_smstr_int_spti_ier_set(channel);

    /* **** Start QSPI transmission and reception. **** */

    /* ---- Wait for reception completion. ---- */
    ret = r_qspi_smstr_rx_dmacdtc_wait(channel, p_qspi_smstr_info->data_cnt);
    if (0 > ret)
    {
        /* ---- Disable QSPI transmission and reception. ---- */
        if ((QSPI_SMSTR_SINGLE_SPI_WRITE     == p_qspi_smstr_info->op_mode) ||
            (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
        {
            p_tx_data = p_qspi_smstr_info->p_tx_data;
            r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
        }
        R_QSPI_SMstr_Int_Spti_Ier_Clear(channel);
        R_QSPI_SMstr_Int_Spri_Ier_Clear(channel);
        R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);
        R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);
        r_qspi_smstr_trx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    /* Clear the ICU.IERm.IENj bit to 0 using DMAC or DTC. */
    R_QSPI_SMstr_Int_Spti_Ier_Clear(channel);
    R_QSPI_SMstr_Int_Spri_Ier_Clear(channel);
    R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);
    R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);

    /* ---- Check QSSL negation. ---- */
    tx_wait = QSPI_SMSTR_QSSL_WAIT;
    ret     = r_qspi_smstr_wait(spsr_addr, tx_wait, QSPI_SMSTR_MASK_SPSSLF);
    if (QSPI_SMSTR_ERR_HARD == ret)
    {
        /* ---- Disable QSPI transmission. ---- */
        if ((QSPI_SMSTR_SINGLE_SPI_WRITE     == p_qspi_smstr_info->op_mode) ||
            (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
        {
            p_tx_data = p_qspi_smstr_info->p_tx_data;
            r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
        }
        r_qspi_smstr_trx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    /* Clear flags of transmit buffer empty, receive buffer full and QSSL negation. */
    /* Disable QSPI transmission and reception. */
    r_qspi_smstr_trx_disable(channel);

    /* ---- Finally exchange receive data according to endian. ----*/
    if ((QSPI_SMSTR_SINGLE_SPI_READ      == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        p_rx_data = p_qspi_smstr_info->p_rx_data;
        ret = r_qspi_smstr_exchg_dmacdtc(channel, p_rx_data, p_qspi_smstr_info->data_cnt);
        if (QSPI_SMSTR_SUCCESS != ret)
        {
            if (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode)
            {
                p_tx_data = p_qspi_smstr_info->p_tx_data;
                r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
            }
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return ret;
        }
    }

    /* ---- Restore to exchange transmit data according to endian. ----*/
    if ((QSPI_SMSTR_SINGLE_SPI_WRITE     == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        p_tx_data = p_qspi_smstr_info->p_tx_data;
        ret = r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
        if (QSPI_SMSTR_SUCCESS != ret)
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return ret;
        }
    }

    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dualquad_write_dmacdtc
* Description  : Transmits data in dual or quad mode using DMAC or DTC.
* Arguments    : channel -
*                    Which channel to use
*                * p_qspi_smstr_info -
*                    QSPI information
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_dualquad_write_dmacdtc(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    uint32_t            tx_wait;
    volatile uint8_t R_BSP_EVENACCESS_SFR * spsr_addr;
    uint8_t * p_tx_data = NULL;

    /* Get address of status register for QSPI. */
    spsr_addr   = r_qspi_smstr_spsr_addr(channel);

    /* ---- Beforehand exchange transmit data according to endian. ----*/
    p_tx_data = p_qspi_smstr_info->p_tx_data;
    ret = r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    /* Set DMAC/DTC transfer end flag for SPTI.  */
    R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_START);

    /* Initialize SPTI interrupt registers. */
    r_qspi_smstr_int_spti_init(channel);

