renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_qspi_smstr_rx/src/r_qspi_smstr.c
    /* Clear flags of transmit buffer empty and QSSL negation. */
    /* Enable QSPI transmission. */
    if (QSPI_SMSTR_DUAL_SPI == p_qspi_smstr_info->op_mode)
    {
        /* Enable QSPI transmission in Dual-SPI. */
        r_qspi_smstr_tx_enable_dual(channel, p_qspi_smstr_info->data_cnt);
    }
    else
    {
        /* Enable QSPI transmission in Quad-SPI. */
        r_qspi_smstr_tx_enable_quad(channel, p_qspi_smstr_info->data_cnt);
    }

    /* Set the ICU.IERm.IENj bit to 1. */
    r_qspi_smstr_int_spti_ier_set(channel);

    /* **** Start QSPI transmission. **** */

    /* ---- Wait for transmission completion of DMAC or DTC. ---- */
    ret = r_qspi_smstr_tx_dmacdtc_wait(channel, p_qspi_smstr_info->data_cnt);
    if (0 > ret)
    {
        /* ---- Disable QSPI transmission. ---- */
        p_tx_data = p_qspi_smstr_info->p_tx_data;
        r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
        R_QSPI_SMstr_Int_Spti_Ier_Clear(channel);
        R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);
        r_qspi_smstr_tx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    /* Clear the ICU.IERm.IENj bit to 0 using DMAC or DTC. */
    R_QSPI_SMstr_Int_Spti_Ier_Clear(channel);
    R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);

    /* ---- Check QSSL negation. ---- */
    tx_wait = QSPI_SMSTR_QSSL_WAIT;
    ret     = r_qspi_smstr_wait(spsr_addr, tx_wait, QSPI_SMSTR_MASK_SPSSLF);
    if (QSPI_SMSTR_ERR_HARD == ret)
    {
        /* ---- Disable QSPI transmission. ---- */
        p_tx_data = p_qspi_smstr_info->p_tx_data;
        r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
        r_qspi_smstr_tx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    /* ---- Restore to exchange transmit data according to endian. ----*/
    p_tx_data = p_qspi_smstr_info->p_tx_data;
    ret = r_qspi_smstr_exchg_dmacdtc(channel, p_tx_data, p_qspi_smstr_info->data_cnt);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    /* Clear flags of transmit buffer empty and QSSL negation. */
    /* Disable QSPI transmission. */
    r_qspi_smstr_tx_disable(channel);

    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dualquad_read_dmacdtc
* Description  : Receives data and stores to the specified buffer in dual or quad mode using DMAC or DTC.
* Arguments    : channel -
*                    Which channel to use
*                * p_qspi_smstr_info -
*                    QSPI information
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_dualquad_read_dmacdtc(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    uint32_t            rx_wait;
    volatile uint8_t R_BSP_EVENACCESS_SFR * spsr_addr;
    uint8_t * p_rx_data = NULL;

    /* Get address of status register for QSPI. */
    spsr_addr   = r_qspi_smstr_spsr_addr(channel);

    /* Set DMAC/DTC transfer end flag for SPRI.  */
    R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_START);

    /* Initialize SPRI interrupt registers. */
    r_qspi_smstr_int_spri_init(channel);

    /* Clear flags of receive buffer full and QSSL negation. */
    /* Enable QSPI reception. */
    if (QSPI_SMSTR_DUAL_SPI == p_qspi_smstr_info->op_mode)
    {
        /* Enable QSPI reception in Dual-SPI. */
        r_qspi_smstr_rx_enable_dual(channel, p_qspi_smstr_info->data_cnt);
    }
    else
    {
        /* Enable QSPI reception in Quad-SPI. */
        r_qspi_smstr_rx_enable_quad(channel, p_qspi_smstr_info->data_cnt);
    }

    /* Set the ICU.IERm.IENj bit to 1. */
    r_qspi_smstr_int_spri_ier_set(channel);

    /* **** Start QSPI reception. **** */

    /* ---- Wait for reception completion of DMAC or DTC. ---- */
    ret = r_qspi_smstr_rx_dmacdtc_wait(channel, p_qspi_smstr_info->data_cnt);
    if (0 > ret)
    {
        /* ---- Disable QSPI reception. ---- */
        R_QSPI_SMstr_Int_Spri_Ier_Clear(channel);
        R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);
        r_qspi_smstr_rx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    /* Clear the ICU.IERm.IENj bit to 0 using DMAC or DTC. */
    R_QSPI_SMstr_Int_Spri_Ier_Clear(channel);
    R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);

    /* ---- Check QSSL negation. ---- */
    rx_wait = QSPI_SMSTR_QSSL_WAIT;
    ret     = r_qspi_smstr_wait(spsr_addr, rx_wait, QSPI_SMSTR_MASK_SPSSLF);
    if (QSPI_SMSTR_ERR_HARD == ret)
    {
        /* ---- Disable QSPI reception. ---- */
        r_qspi_smstr_rx_disable(channel);
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    /* Clear flags of receive buffer full and QSSL negation. */
    /* Disable QSPI transmission. */
    r_qspi_smstr_rx_disable(channel);

    /* ---- Finally exchange receive data according to endian. ----*/
    p_rx_data = p_qspi_smstr_info->p_rx_data;
    ret = r_qspi_smstr_exchg_dmacdtc(channel, p_rx_data, p_qspi_smstr_info->data_cnt);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return ret;
    }

    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_tx_exchg
* Description  : Exchanges transmit data according to endian.
* Arguments    : channel -
*                    Which channel to use
*              : * p_data -
*                    Pointer to transmit data
*              : * p_dataadr -
*                    Pointer to exchanged data
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_tx_exchg(uint8_t channel, uint8_t * p_data, uint32_t * p_dataadr)
{
#if (QSPI_SMSTR_LITTLE_ENDIAN)
    *p_dataadr++ = R_BSP_REVL(*(uint32_t *)p_data);
    *p_dataadr++ = R_BSP_REVL(*(uint32_t *)(p_data+QSPI_SMSTR_TRAN_SIZE));
    *p_dataadr++ = R_BSP_REVL(*(uint32_t *)(p_data+(QSPI_SMSTR_TRAN_SIZE*2)));
    *p_dataadr   = R_BSP_REVL(*(uint32_t *)(p_data+(QSPI_SMSTR_TRAN_SIZE*3)));
#else
    *p_dataadr++ = *(uint32_t *)p_data;
    *p_dataadr++ = *(uint32_t *)(p_data+QSPI_SMSTR_TRAN_SIZE);
    *p_dataadr++ = *(uint32_t *)(p_data+(QSPI_SMSTR_TRAN_SIZE*2));
    *p_dataadr   = *(uint32_t *)(p_data+(QSPI_SMSTR_TRAN_SIZE*3));
#endif
}


