renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_qspi_smstr_rx/src/r_qspi_smstr.c
/*******************************************************************************
* Function Name: r_qspi_smstr_rx_software_trans_dummy
* Description  : Transfers dummy data of 16 bytes from QSPI Data Register using software.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_rx_software_trans_dummy(uint8_t channel)
{
    volatile uint32_t   ul_tmp;

    /* Read data of 16 bytes in long word only. Do not store the data to RAM. */
    ul_tmp = r_qspi_smstr_data_get_long(channel);
    ul_tmp = r_qspi_smstr_data_get_long(channel);
    ul_tmp = r_qspi_smstr_data_get_long(channel);
    ul_tmp = r_qspi_smstr_data_get_long(channel);
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Get_BuffRegAddress
 *****************************************************************************************************************/ /**
 * @brief This function is used to fetch the address of the QSPI data register (SPDR).
 * @param[in] channel
 *             QSPI channel number
 * @param[in] *p_spdr_adr
 *             The pointer for storing the address of SPDR. Set this to the address of the storage destination.
 * @retval    QSPI_SMSTR_SUCCESS     Successful operation
 * @retval    QSPI_SMSTR_ERR_PARAM   Parameter error
 * @details   Use this function when setting the DMAC or DTC transfer destination/transfer source address, etc.
 * @note      None
 */
qspi_smstr_status_t R_QSPI_SMstr_Get_BuffRegAddress(uint8_t channel, uint32_t *p_spdr_adr)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_spdr_adr)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    r_qspi_smstr_get_buffregaddress(channel, p_spdr_adr);

    return QSPI_SMSTR_SUCCESS;
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_GetVersion
 *****************************************************************************************************************/ /**
 * @brief This function is used to fetch the driver version information.
 * @return    Version number.   Upper 2 bytes: major version, lower 2 bytes: minor version.
 * @details   Returns the version information.
 * @note      None
 */
uint32_t R_QSPI_SMstr_GetVersion(void)
{
    uint32_t const version = (QSPI_SMSTR_VERSION_MAJOR << 16) | QSPI_SMSTR_VERSION_MINOR;
    
    return version;
}

/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Set_LogHdlAddress
 *****************************************************************************************************************/ /**
 * @brief This function specifies the handler address for the LONGQ FIT module. Call this function when using error 
 *        log acquisition processing.
 * @param[in] user_long_que
 *             Specify the handler address of the LONGQ FIT module.
 * @retval    QSPI_SMSTR_SUCCESS   Successful operation
 * @details   The handler address of the LONGQ FIT module is set in the QSPI FIT module. \n
 *            Uses the LONGQ FIT module perform preparatory processing for fetching the error log. \n
 *            Run this processing before calling R_QSPI_SMstr_Open().
 * @note      Incorporate the LONGQ FIT module separately. Also, enable
 *            QSPI_SMSTR_CFG_LONGQ_ENABLE in r_qspi_smstr_rx_config.h. \n
 *            If the QSPI_SMSTR_CFG_LONGQ_ENABLE disable and this function is called, this function does nothing.
 */
qspi_smstr_status_t R_QSPI_SMstr_Set_LogHdlAddress(uint32_t user_long_que)
{
#ifdef QSPI_SMSTR_CFG_LONGQ_ENABLE
    p_qspi_smstr_long_que = (longq_hdl_t)user_long_que;
#endif  /* QSPI_SMSTR_CFG_LONGQ_ENABLE */
    return QSPI_SMSTR_SUCCESS;
}

#ifdef QSPI_SMSTR_CFG_LONGQ_ENABLE
/*******************************************************************************
* Function Name: r_qspi_smstr_log
* Description  : Stores error information to LONGQ buffer.
* Arguments    : flg -
*                    Breakpoint processing
*                fid -
*                    QSPI driver file No.
*                line -
*                    QSPI driver line number
* Return Value : 0 -
*                    Successful operation
*                1 -
*                    Error
*******************************************************************************/
uint32_t r_qspi_smstr_log(uint32_t flg, uint32_t fid, uint32_t line)
{
    longq_err_t err;
    uint32_t    ul_tmp;

    /* Long to Byte */
    ul_tmp = 0;                                         /* smstr_log   Reserved               */
    ul_tmp = (ul_tmp | (line << 8));                    /* smstr_log   LINE                   */
    ul_tmp = (ul_tmp | (fid  << 21));                   /* smstr_log   FID FILE No.           */
    ul_tmp = (ul_tmp | (QSPI_SMSTR_DRIVER_ID << 27));     /* smstr_log   FID DRIVER No.         */
    ul_tmp = (ul_tmp | (flg  << 31));                   /* smstr_log   Breakpoint processing  */

    err = R_LONGQ_Put(p_qspi_smstr_long_que, ul_tmp);
    if (err != LONGQ_SUCCESS)
    {
        return 1;
    }

    /* Breakpoint processing */
    if (0x80000000 == (ul_tmp & 0x80000000))
    {
        return 1;
    }
    return 0;
}
#endif  /* QSPI_SMSTR_CFG_LONGQ_ENABLE */

/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Log
 *****************************************************************************************************************/ /**
 * @brief This function fetches the error log. When an error occurs, call this function immediately before user 
 *        processing ends.
 * @param[in] flg
 *             Set this to 0x00000001 (fixed value).
 * @param[in] fid
 *             Set this to 0x0000003f (fixed value).
 * @param[in] line
 *             Set this to 0x0001ffff (fixed value).
 * @retval    0    Successful operation
 * @retval    1    Error
 * @details   This function fetches the error log. Executes the end processing of fetching the error log using LONGQ 
 *            FIT module. When an error occurs, call this function immediately before user processing ends. \n
 *            For the setting of the error log size, refer to the LONGQ FIT module. \n
 * @note      Incorporate the LONGQ FIT module separately. Also, enable
 *            QSPI_SMSTR_CFG_LONGQ_ENABLE in r_qspi_smstr_rx_config.h. \n
 *            If the QSPI_SMSTR_CFG_LONGQ_ENABLE disable and this function is called, this function does nothing.
 */
uint32_t R_QSPI_SMstr_Log(uint32_t flg, uint32_t fid, uint32_t line)
{
    R_QSPI_SMSTR_LOG_FUNC(flg, fid, line);
    return 0;
}

/* End of File */

